Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_interrupt/firmware/src/packs/ATSAMV71Q21B_DFP/component/mlb.h
/* -------- MLB_MSD : (MLB Offset: 0x24) (R/  32) MediaLB System Data Register -------- */
#define MLB_MSD_SD0_Pos                       (0U)                                           /**< (MLB_MSD) System Data (Byte 0) Position */
#define MLB_MSD_SD0_Msk                       (0xFFU << MLB_MSD_SD0_Pos)                     /**< (MLB_MSD) System Data (Byte 0) Mask */
#define MLB_MSD_SD0(value)                    (MLB_MSD_SD0_Msk & ((value) << MLB_MSD_SD0_Pos))
#define MLB_MSD_SD1_Pos                       (8U)                                           /**< (MLB_MSD) System Data (Byte 1) Position */
#define MLB_MSD_SD1_Msk                       (0xFFU << MLB_MSD_SD1_Pos)                     /**< (MLB_MSD) System Data (Byte 1) Mask */
#define MLB_MSD_SD1(value)                    (MLB_MSD_SD1_Msk & ((value) << MLB_MSD_SD1_Pos))
#define MLB_MSD_SD2_Pos                       (16U)                                          /**< (MLB_MSD) System Data (Byte 2) Position */
#define MLB_MSD_SD2_Msk                       (0xFFU << MLB_MSD_SD2_Pos)                     /**< (MLB_MSD) System Data (Byte 2) Mask */
#define MLB_MSD_SD2(value)                    (MLB_MSD_SD2_Msk & ((value) << MLB_MSD_SD2_Pos))
#define MLB_MSD_SD3_Pos                       (24U)                                          /**< (MLB_MSD) System Data (Byte 3) Position */
#define MLB_MSD_SD3_Msk                       (0xFFU << MLB_MSD_SD3_Pos)                     /**< (MLB_MSD) System Data (Byte 3) Mask */
#define MLB_MSD_SD3(value)                    (MLB_MSD_SD3_Msk & ((value) << MLB_MSD_SD3_Pos))
#define MLB_MSD_Msk                           (0xFFFFFFFFUL)                                 /**< (MLB_MSD) Register Mask  */

/* -------- MLB_MIEN : (MLB Offset: 0x2C) (R/W 32) MediaLB Interrupt Enable Register -------- */
#define MLB_MIEN_ISOC_PE_Pos                  (0U)                                           /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ISOC_PE_Msk                  (0x1U << MLB_MIEN_ISOC_PE_Pos)                 /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ISOC_PE(value)               (MLB_MIEN_ISOC_PE_Msk & ((value) << MLB_MIEN_ISOC_PE_Pos))
#define MLB_MIEN_ISOC_BUFO_Pos                (1U)                                           /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Position */
#define MLB_MIEN_ISOC_BUFO_Msk                (0x1U << MLB_MIEN_ISOC_BUFO_Pos)               /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Mask */
#define MLB_MIEN_ISOC_BUFO(value)             (MLB_MIEN_ISOC_BUFO_Msk & ((value) << MLB_MIEN_ISOC_BUFO_Pos))
#define MLB_MIEN_SYNC_PE_Pos                  (16U)                                          /**< (MLB_MIEN) Synchronous Protocol Error Enable Position */
#define MLB_MIEN_SYNC_PE_Msk                  (0x1U << MLB_MIEN_SYNC_PE_Pos)                 /**< (MLB_MIEN) Synchronous Protocol Error Enable Mask */
#define MLB_MIEN_SYNC_PE(value)               (MLB_MIEN_SYNC_PE_Msk & ((value) << MLB_MIEN_SYNC_PE_Pos))
#define MLB_MIEN_ARX_DONE_Pos                 (17U)                                          /**< (MLB_MIEN) Asynchronous Rx Done Enable Position */
#define MLB_MIEN_ARX_DONE_Msk                 (0x1U << MLB_MIEN_ARX_DONE_Pos)                /**< (MLB_MIEN) Asynchronous Rx Done Enable Mask */
#define MLB_MIEN_ARX_DONE(value)              (MLB_MIEN_ARX_DONE_Msk & ((value) << MLB_MIEN_ARX_DONE_Pos))
#define MLB_MIEN_ARX_PE_Pos                   (18U)                                          /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ARX_PE_Msk                   (0x1U << MLB_MIEN_ARX_PE_Pos)                  /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ARX_PE(value)                (MLB_MIEN_ARX_PE_Msk & ((value) << MLB_MIEN_ARX_PE_Pos))
#define MLB_MIEN_ARX_BREAK_Pos                (19U)                                          /**< (MLB_MIEN) Asynchronous Rx Break Enable Position */
#define MLB_MIEN_ARX_BREAK_Msk                (0x1U << MLB_MIEN_ARX_BREAK_Pos)               /**< (MLB_MIEN) Asynchronous Rx Break Enable Mask */
#define MLB_MIEN_ARX_BREAK(value)             (MLB_MIEN_ARX_BREAK_Msk & ((value) << MLB_MIEN_ARX_BREAK_Pos))
#define MLB_MIEN_ATX_DONE_Pos                 (20U)                                          /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Position */
#define MLB_MIEN_ATX_DONE_Msk                 (0x1U << MLB_MIEN_ATX_DONE_Pos)                /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Mask */
#define MLB_MIEN_ATX_DONE(value)              (MLB_MIEN_ATX_DONE_Msk & ((value) << MLB_MIEN_ATX_DONE_Pos))
#define MLB_MIEN_ATX_PE_Pos                   (21U)                                          /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Position */
#define MLB_MIEN_ATX_PE_Msk                   (0x1U << MLB_MIEN_ATX_PE_Pos)                  /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Mask */
#define MLB_MIEN_ATX_PE(value)                (MLB_MIEN_ATX_PE_Msk & ((value) << MLB_MIEN_ATX_PE_Pos))
#define MLB_MIEN_ATX_BREAK_Pos                (22U)                                          /**< (MLB_MIEN) Asynchronous Tx Break Enable Position */
#define MLB_MIEN_ATX_BREAK_Msk                (0x1U << MLB_MIEN_ATX_BREAK_Pos)               /**< (MLB_MIEN) Asynchronous Tx Break Enable Mask */
#define MLB_MIEN_ATX_BREAK(value)             (MLB_MIEN_ATX_BREAK_Msk & ((value) << MLB_MIEN_ATX_BREAK_Pos))
#define MLB_MIEN_CRX_DONE_Pos                 (24U)                                          /**< (MLB_MIEN) Control Rx Packet Done Enable Position */
#define MLB_MIEN_CRX_DONE_Msk                 (0x1U << MLB_MIEN_CRX_DONE_Pos)                /**< (MLB_MIEN) Control Rx Packet Done Enable Mask */
#define MLB_MIEN_CRX_DONE(value)              (MLB_MIEN_CRX_DONE_Msk & ((value) << MLB_MIEN_CRX_DONE_Pos))
#define MLB_MIEN_CRX_PE_Pos                   (25U)                                          /**< (MLB_MIEN) Control Rx Protocol Error Enable Position */
#define MLB_MIEN_CRX_PE_Msk                   (0x1U << MLB_MIEN_CRX_PE_Pos)                  /**< (MLB_MIEN) Control Rx Protocol Error Enable Mask */
#define MLB_MIEN_CRX_PE(value)                (MLB_MIEN_CRX_PE_Msk & ((value) << MLB_MIEN_CRX_PE_Pos))
#define MLB_MIEN_CRX_BREAK_Pos                (26U)                                          /**< (MLB_MIEN) Control Rx Break Enable Position */
#define MLB_MIEN_CRX_BREAK_Msk                (0x1U << MLB_MIEN_CRX_BREAK_Pos)               /**< (MLB_MIEN) Control Rx Break Enable Mask */
#define MLB_MIEN_CRX_BREAK(value)             (MLB_MIEN_CRX_BREAK_Msk & ((value) << MLB_MIEN_CRX_BREAK_Pos))
#define MLB_MIEN_CTX_DONE_Pos                 (27U)                                          /**< (MLB_MIEN) Control Tx Packet Done Enable Position */
#define MLB_MIEN_CTX_DONE_Msk                 (0x1U << MLB_MIEN_CTX_DONE_Pos)                /**< (MLB_MIEN) Control Tx Packet Done Enable Mask */
#define MLB_MIEN_CTX_DONE(value)              (MLB_MIEN_CTX_DONE_Msk & ((value) << MLB_MIEN_CTX_DONE_Pos))
#define MLB_MIEN_CTX_PE_Pos                   (28U)                                          /**< (MLB_MIEN) Control Tx Protocol Error Enable Position */
#define MLB_MIEN_CTX_PE_Msk                   (0x1U << MLB_MIEN_CTX_PE_Pos)                  /**< (MLB_MIEN) Control Tx Protocol Error Enable Mask */
#define MLB_MIEN_CTX_PE(value)                (MLB_MIEN_CTX_PE_Msk & ((value) << MLB_MIEN_CTX_PE_Pos))
#define MLB_MIEN_CTX_BREAK_Pos                (29U)                                          /**< (MLB_MIEN) Control Tx Break Enable Position */
#define MLB_MIEN_CTX_BREAK_Msk                (0x1U << MLB_MIEN_CTX_BREAK_Pos)               /**< (MLB_MIEN) Control Tx Break Enable Mask */
#define MLB_MIEN_CTX_BREAK(value)             (MLB_MIEN_CTX_BREAK_Msk & ((value) << MLB_MIEN_CTX_BREAK_Pos))
#define MLB_MIEN_Msk                          (0x3F7F0003UL)                                 /**< (MLB_MIEN) Register Mask  */

/* -------- MLB_MLBC1 : (MLB Offset: 0x3C) (R/W 32) MediaLB Control 1 Register -------- */
#define MLB_MLBC1_LOCK_Pos                    (6U)                                           /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Position */
#define MLB_MLBC1_LOCK_Msk                    (0x1U << MLB_MLBC1_LOCK_Pos)                   /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_LOCK(value)                 (MLB_MLBC1_LOCK_Msk & ((value) << MLB_MLBC1_LOCK_Pos))
#define MLB_MLBC1_CLKM_Pos                    (7U)                                           /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Position */
#define MLB_MLBC1_CLKM_Msk                    (0x1U << MLB_MLBC1_CLKM_Pos)                   /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_CLKM(value)                 (MLB_MLBC1_CLKM_Msk & ((value) << MLB_MLBC1_CLKM_Pos))
#define MLB_MLBC1_NDA_Pos                     (8U)                                           /**< (MLB_MLBC1) Node Device Address Position */
#define MLB_MLBC1_NDA_Msk                     (0xFFU << MLB_MLBC1_NDA_Pos)                   /**< (MLB_MLBC1) Node Device Address Mask */
#define MLB_MLBC1_NDA(value)                  (MLB_MLBC1_NDA_Msk & ((value) << MLB_MLBC1_NDA_Pos))
#define MLB_MLBC1_Msk                         (0x0000FFC0UL)                                 /**< (MLB_MLBC1) Register Mask  */

