Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_interrupt/firmware/src/packs/ATSAMV71Q21B_DFP/component/mlb.h
/* -------- MLB_HCTL : (MLB Offset: 0x80) (R/W 32) HBI Control Register -------- */
#define MLB_HCTL_RST0_Pos                     (0U)                                           /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Position */
#define MLB_HCTL_RST0_Msk                     (0x1U << MLB_HCTL_RST0_Pos)                    /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Mask */
#define MLB_HCTL_RST0(value)                  (MLB_HCTL_RST0_Msk & ((value) << MLB_HCTL_RST0_Pos))
#define MLB_HCTL_RST1_Pos                     (1U)                                           /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Position */
#define MLB_HCTL_RST1_Msk                     (0x1U << MLB_HCTL_RST1_Pos)                    /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Mask */
#define MLB_HCTL_RST1(value)                  (MLB_HCTL_RST1_Msk & ((value) << MLB_HCTL_RST1_Pos))
#define MLB_HCTL_EN_Pos                       (15U)                                          /**< (MLB_HCTL) HBI Enable Position */
#define MLB_HCTL_EN_Msk                       (0x1U << MLB_HCTL_EN_Pos)                      /**< (MLB_HCTL) HBI Enable Mask */
#define MLB_HCTL_EN(value)                    (MLB_HCTL_EN_Msk & ((value) << MLB_HCTL_EN_Pos))
#define MLB_HCTL_Msk                          (0x00008003UL)                                 /**< (MLB_HCTL) Register Mask  */

/* -------- MLB_HCMR : (MLB Offset: 0x88) (R/W 32) HBI Channel Mask 0 Register 0 -------- */
#define MLB_HCMR_CHM_Pos                      (0U)                                           /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Position */
#define MLB_HCMR_CHM_Msk                      (0xFFFFFFFFU << MLB_HCMR_CHM_Pos)              /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Mask */
#define MLB_HCMR_CHM(value)                   (MLB_HCMR_CHM_Msk & ((value) << MLB_HCMR_CHM_Pos))
#define MLB_HCMR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCMR) Register Mask  */

/* -------- MLB_HCER : (MLB Offset: 0x90) (R/  32) HBI Channel Error 0 Register 0 -------- */
#define MLB_HCER_CERR_Pos                     (0U)                                           /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Position */
#define MLB_HCER_CERR_Msk                     (0xFFFFFFFFU << MLB_HCER_CERR_Pos)             /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Mask */
#define MLB_HCER_CERR(value)                  (MLB_HCER_CERR_Msk & ((value) << MLB_HCER_CERR_Pos))
#define MLB_HCER_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCER) Register Mask  */

/* -------- MLB_HCBR : (MLB Offset: 0x98) (R/  32) HBI Channel Busy 0 Register 0 -------- */
#define MLB_HCBR_CHB_Pos                      (0U)                                           /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Position */
#define MLB_HCBR_CHB_Msk                      (0xFFFFFFFFU << MLB_HCBR_CHB_Pos)              /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Mask */
#define MLB_HCBR_CHB(value)                   (MLB_HCBR_CHB_Msk & ((value) << MLB_HCBR_CHB_Pos))
#define MLB_HCBR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCBR) Register Mask  */

/* -------- MLB_MDAT : (MLB Offset: 0xC0) (R/W 32) MIF Data 0 Register 0 -------- */
#define MLB_MDAT_DATA_Pos                     (0U)                                           /**< (MLB_MDAT) CRT or DBR Data Position */
#define MLB_MDAT_DATA_Msk                     (0xFFFFFFFFU << MLB_MDAT_DATA_Pos)             /**< (MLB_MDAT) CRT or DBR Data Mask */
#define MLB_MDAT_DATA(value)                  (MLB_MDAT_DATA_Msk & ((value) << MLB_MDAT_DATA_Pos))
#define MLB_MDAT_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_MDAT) Register Mask  */

/* -------- MLB_MDWE : (MLB Offset: 0xD0) (R/W 32) MIF Data Write Enable 0 Register 0 -------- */
#define MLB_MDWE_MASK_Pos                     (0U)                                           /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Position */
#define MLB_MDWE_MASK_Msk                     (0xFFFFFFFFU << MLB_MDWE_MASK_Pos)             /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Mask */
#define MLB_MDWE_MASK(value)                  (MLB_MDWE_MASK_Msk & ((value) << MLB_MDWE_MASK_Pos))
#define MLB_MDWE_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_MDWE) Register Mask  */

/* -------- MLB_MCTL : (MLB Offset: 0xE0) (R/W 32) MIF Control Register -------- */
#define MLB_MCTL_XCMP_Pos                     (0U)                                           /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Position */
#define MLB_MCTL_XCMP_Msk                     (0x1U << MLB_MCTL_XCMP_Pos)                    /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Mask */
#define MLB_MCTL_XCMP(value)                  (MLB_MCTL_XCMP_Msk & ((value) << MLB_MCTL_XCMP_Pos))
#define MLB_MCTL_Msk                          (0x00000001UL)                                 /**< (MLB_MCTL) Register Mask  */

/* -------- MLB_MADR : (MLB Offset: 0xE4) (R/W 32) MIF Address Register -------- */
#define MLB_MADR_ADDR_Pos                     (0U)                                           /**< (MLB_MADR) CTR or DBR Address Position */
#define MLB_MADR_ADDR_Msk                     (0x3FFFU << MLB_MADR_ADDR_Pos)                 /**< (MLB_MADR) CTR or DBR Address Mask */
#define MLB_MADR_ADDR(value)                  (MLB_MADR_ADDR_Msk & ((value) << MLB_MADR_ADDR_Pos))
#define MLB_MADR_TB_Pos                       (30U)                                          /**< (MLB_MADR) Target Location Bit Position */
#define MLB_MADR_TB_Msk                       (0x1U << MLB_MADR_TB_Pos)                      /**< (MLB_MADR) Target Location Bit Mask */
#define MLB_MADR_TB(value)                    (MLB_MADR_TB_Msk & ((value) << MLB_MADR_TB_Pos))
#define   MLB_MADR_TB_CTR_Val                 (0U)                                           /**< (MLB_MADR) Selects CTR  */
#define   MLB_MADR_TB_DBR_Val                 (1U)                                           /**< (MLB_MADR) Selects DBR  */
#define MLB_MADR_TB_CTR                       (MLB_MADR_TB_CTR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects CTR Position  */
#define MLB_MADR_TB_DBR                       (MLB_MADR_TB_DBR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects DBR Position  */
#define MLB_MADR_WNR_Pos                      (31U)                                          /**< (MLB_MADR) Write-Not-Read Selection Position */
#define MLB_MADR_WNR_Msk                      (0x1U << MLB_MADR_WNR_Pos)                     /**< (MLB_MADR) Write-Not-Read Selection Mask */
#define MLB_MADR_WNR(value)                   (MLB_MADR_WNR_Msk & ((value) << MLB_MADR_WNR_Pos))
#define MLB_MADR_Msk                          (0xC0003FFFUL)                                 /**< (MLB_MADR) Register Mask  */

/* -------- MLB_ACTL : (MLB Offset: 0x3C0) (R/W 32) AHB Control Register -------- */
#define MLB_ACTL_SCE_Pos                      (0U)                                           /**< (MLB_ACTL) Software Clear Enable Position */
#define MLB_ACTL_SCE_Msk                      (0x1U << MLB_ACTL_SCE_Pos)                     /**< (MLB_ACTL) Software Clear Enable Mask */
#define MLB_ACTL_SCE(value)                   (MLB_ACTL_SCE_Msk & ((value) << MLB_ACTL_SCE_Pos))
#define MLB_ACTL_SMX_Pos                      (1U)                                           /**< (MLB_ACTL) AHB Interrupt Mux Enable Position */
#define MLB_ACTL_SMX_Msk                      (0x1U << MLB_ACTL_SMX_Pos)                     /**< (MLB_ACTL) AHB Interrupt Mux Enable Mask */
#define MLB_ACTL_SMX(value)                   (MLB_ACTL_SMX_Msk & ((value) << MLB_ACTL_SMX_Pos))
#define MLB_ACTL_DMA_MODE_Pos                 (2U)                                           /**< (MLB_ACTL) DMA Mode Position */
#define MLB_ACTL_DMA_MODE_Msk                 (0x1U << MLB_ACTL_DMA_MODE_Pos)                /**< (MLB_ACTL) DMA Mode Mask */
#define MLB_ACTL_DMA_MODE(value)              (MLB_ACTL_DMA_MODE_Msk & ((value) << MLB_ACTL_DMA_MODE_Pos))
#define MLB_ACTL_MPB_Pos                      (4U)                                           /**< (MLB_ACTL) DMA Packet Buffering Mode Position */
#define MLB_ACTL_MPB_Msk                      (0x1U << MLB_ACTL_MPB_Pos)                     /**< (MLB_ACTL) DMA Packet Buffering Mode Mask */
#define MLB_ACTL_MPB(value)                   (MLB_ACTL_MPB_Msk & ((value) << MLB_ACTL_MPB_Pos))
#define   MLB_ACTL_MPB_SINGLE_PACKET_Val      (0U)                                           /**< (MLB_ACTL) Single-packet mode  */
#define   MLB_ACTL_MPB_MULTIPLE_PACKET_Val    (1U)                                           /**< (MLB_ACTL) Multiple-packet mode  */
#define MLB_ACTL_MPB_SINGLE_PACKET            (MLB_ACTL_MPB_SINGLE_PACKET_Val << MLB_ACTL_MPB_Pos) /**< (MLB_ACTL) Single-packet mode Position  */
#define MLB_ACTL_MPB_MULTIPLE_PACKET          (MLB_ACTL_MPB_MULTIPLE_PACKET_Val << MLB_ACTL_MPB_Pos) /**< (MLB_ACTL) Multiple-packet mode Position  */
#define MLB_ACTL_Msk                          (0x00000017UL)                                 /**< (MLB_ACTL) Register Mask  */

/* -------- MLB_ACSR : (MLB Offset: 0x3D0) (R/W 32) AHB Channel Status 0 Register 0 -------- */
#define MLB_ACSR_CHS_Pos                      (0U)                                           /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Position */
#define MLB_ACSR_CHS_Msk                      (0xFFFFFFFFU << MLB_ACSR_CHS_Pos)              /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Mask */
#define MLB_ACSR_CHS(value)                   (MLB_ACSR_CHS_Msk & ((value) << MLB_ACSR_CHS_Pos))
#define MLB_ACSR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_ACSR) Register Mask  */

